class Calculator:

   def multiply(self, x, y):
       '''метод позволяющий производить умножение при вводе аргументов(чисел)'''
       return x * y

   def division(self, x, y):
       '''метод позволяющий производить деление при вводе аргументов(чисел)'''
       return x / y

   def subtraction(self, x, y):
       '''метод позволяющий производить вычитание при вводе аргументов(чисел)'''
       return x - y

   def adding(self, x, y):
       '''метод позволяющий производить сложение при вводе аргументов(чисел)'''
       return x + y